src/Sklad/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаСборку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Sklad/cf/CommonModules/СтатусыДокументовВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтатусЗаказаНаСборку(ЗаказНаСборку) Экспорт

	Результат = Перечисления.СтатусыЗаказовНаСборку.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыДокументов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|ГДЕ
	|	СтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ЗаказНаСборку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.Статус;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ОбновитьСтатусЗаказаНаСборку(ЗаказНаСборку, НовыйСтатус) Экспорт

	Если ТипЗнч(НовыйСтатус) = Тип("Строка") Тогда	
		Статус = Перечисления.СтатусыЗаказовНаСборку[НовыйСтатус];
	Иначе
		Статус = НовыйСтатус;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = ЗаказНаСборку;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Записать();	
	
КонецПроцедуры

#КонецОбласти
